const socialStatus = [
	{ value: 'благополучная семья', label: 'благополучная семья' },
	{ value: 'инвалид детства', label: 'инвалид детства' },
	{ value: 'инвалид 1 группы', label: 'инвалид 1 группы' },
	{ value: 'инвалид 2 группы', label: 'инвалид 2 группы' },
	{ value: 'инвалид 3 группы', label: 'инвалид 3 группы' },
	{
		value: 'дети сироты (школа интернат)',
		label: 'дети сироты (школа интернат)'
	},
	{
		value: 'дети сироты (патронатная семья)',
		label: 'дети сироты (патронатная семья)'
	}
]

const regions = [
	{ value: 'Акмолинская', label: 'Акмолинская' },
	{ value: 'Актюбинская', label: 'Актюбинская' },
	{ value: 'Алматинская', label: 'Алматинская' },
	{ value: 'Алматы', label: 'Алматы' },
	{ value: 'Астана', label: 'Астана' },
	{ value: 'Атырауская', label: 'Атырауская' },
	{
		value: 'Восточно-Казахстанская область',
		label: 'Восточно-Казахстанская область'
	},
	{ value: 'Жамбылская', label: 'Жамбылская' },
	{ value: 'ЗКО', label: 'ЗКО' },
	{ value: 'Карагандинская', label: 'Карагандинская' },
	{ value: 'Костанайская', label: 'Костанайская' },
	{ value: 'Кызылординская', label: 'Кызылординская' },
	{ value: 'Мангыстауская', label: 'Мангыстауская' },
	{ value: 'Павлодарская', label: 'Павлодарская' },
	{
		value: 'Северо-Казахстанская область',
		label: 'Северо-Казахстанская область'
	},
	{ value: 'Туркестанская', label: 'Туркестанская' },
	{ value: 'Шымкент', label: 'Шымкент' },
	{ value: 'ЮКО', label: 'ЮКО' }
]

const cities = [
	{ value: 'Абай', label: 'Абай' },
	{ value: 'Караганда', label: 'Караганда' },
	{ value: 'Шахтинск', label: 'Шахтинск' },
	{ value: 'Сарань', label: 'Сарань' },
	{ value: 'Темиртау', label: 'Темиртау' },
	{ value: 'Приозерск', label: 'Приозерск' },
	{ value: 'Балхаш', label: 'Балхаш' },
	{ value: 'Жезказган', label: 'Жезказган' },
	{ value: 'Сатпаев', label: 'Сатпаев' },
	{ value: 'Улытауский', label: 'Улытауский' },
	{ value: 'Актогайский', label: 'Актогайский' },
	{ value: 'Абайский', label: 'Абайский' },
	{ value: 'Бухар-Жырауский', label: 'Бухар-Жырауский' },
	{ value: 'Жанааркинский', label: 'Жанааркинский' },
	{ value: 'Каражал', label: 'Каражал' },
	{ value: 'Нуринский', label: 'Нуринский' },
	{ value: 'Каркаралинский', label: 'Каркаралинский' },
	{ value: 'Осакаровский', label: 'Осакаровский' },
	{ value: 'Шетский', label: 'Шетский' },
	{
		value: 'Акмолинская область (все районы и города)',
		label: 'Акмолинская область (все районы и города)'
	},
	{
		value: 'Актюбинская область (все районы и города)',
		label: 'Актюбинская область (все районы и города)'
	},
	{
		value: 'Алматинская (все районы и города)',
		label: 'Алматинская (все районы и города)'
	},
	{
		value: 'Восточно-Казахстанская область (все районы и города)',
		label: 'Восточно-Казахстанская область (все районы и города)'
	},
	{ value: 'Астана', label: 'Астана' },
	{ value: 'Шымкент', label: 'Шымкент' },
	{
		value: 'Жамбылская область (все районы и города)',
		label: 'Жамбылская область (все районы и города)'
	},
	{
		value: 'Западно-Казахстанская область (все районы и города)',
		label: 'Западно-Казахстанская область (все районы и города)'
	},
	{
		value: 'Костанайская область (все районы и города)',
		label: 'Костанайская область (все районы и города)'
	},
	{
		value: 'Северо-Казахстанская область (все районы и города)',
		label: 'Северо-Казахстанская область (все районы и города)'
	},
	{
		value: 'Атырауская область (все районы и города)',
		label: 'Атырауская область (все районы и города)'
	},
	{ value: 'Алматы', label: 'Алматы' },
	{
		value: 'Кызылординская область (все районы и города)',
		label: 'Кызылординская область (все районы и города)'
	},
	{
		value: 'Мангыстауская область (все районы и города)',
		label: 'Мангыстауская область (все районы и города)'
	},
	{
		value: 'Павлодарская область (все районы и города)',
		label: 'Павлодарская область (все районы и города)'
	},
	{
		value: 'Туркестанская область (все районы и города)',
		label: 'Туркестанская область (все районы и города)'
	}
]

const institutionType = [
	{ value: 'школа', label: 'школа' },
	{ value: 'колледж', label: 'колледж' },
	{
		value: 'университет (бакалавриат/магистратура)',
		label: 'университет (бакалавриат/магистратура)'
	},
	{
		value: 'предприятие корпоративного университета',
		label: 'предприятие корпоративного университета'
	},
	{ value: 'другое', label: 'другое' }
]

const institutions = [
	{
		value: 'Карагандинский технический университет',
		label: 'Карагандинский технический университет'
	},
	{ value: 'Карагандинский университет', label: 'Карагандинский университет' },
	{ value: 'Академия Болашак', label: 'Академия Болашак' },
	{
		value: 'Карагандинский экономический университет',
		label: 'Карагандинский экономический университет'
	},
	{ value: 'другое учебное заведение', label: 'другое учебное заведение' }
]

const formStudy = [
	{ value: 'дневная', label: 'дневная' },
	{ value: 'дневная сокращенная', label: 'дневная сокращенная' },
	{ value: 'магистратура', label: 'магистратура' },
	{ value: 'докторантура', label: 'докторантура' },
	{ value: 'второе высшее', label: 'второе высшее' },
	{ value: 'дистанционная сокращенная', label: 'дистанционная сокращенная' },
	{
		value: 'очная (для поступающих в КИТ)',
		label: 'очная (для поступающих в КИТ)'
	},
	{
		value: 'заочная (для поступающих в КИТ)',
		label: 'заочная (для поступающих в КИТ)'
	}
]

const educationProgram = [
	{ value: 'Не определился', label: 'Не определился' },
	{
		value: 'В044 Менеджмент и управление',
		label: 'В044 Менеджмент и управление'
	},
	{
		value: 'В045 Аудит и налогообложение',
		label: 'В045 Аудит и налогообложение'
	},
	{
		value: 'В046 Финансы, экономика, банковское и страховое дело',
		label: 'В046 Финансы, экономика, банковское и страховое дело'
	},
	{
		value: 'В050 Биологические и смежные науки',
		label: 'В050 Биологические и смежные науки'
	},
	{
		value: 'В057 Информационные технологии',
		label: 'В057 Информационные технологии'
	},
	{
		value: 'В058 Информационная безопасность',
		label: 'В058 Информационная безопасность'
	},
	{
		value: 'В059 Коммуникации и коммуникационные технологии',
		label: 'В059 Коммуникации и коммуникационные технологии'
	},
	{
		value: 'В060 Химическая инженерия и процессы',
		label: 'В060 Химическая инженерия и процессы'
	},
	{
		value: 'В061 Материаловедение и технологии',
		label: 'В061 Материаловедение и технологии'
	},
	{
		value: 'В062 Электротехника и энергетика',
		label: 'В062 Электротехника и энергетика'
	},
	{
		value: 'В063 Электротехника и автоматизация',
		label: 'В063 Электротехника и автоматизация'
	},
	{
		value: 'В064 Механика и металлообработкая',
		label: 'В064 Механика и металлообработка'
	},
	{
		value: 'В065 Автотранспортные средства',
		label: 'В065 Автотранспортные средства'
	},
	{
		value: 'В071 Горное дело и добыча полезных ископаемых',
		label: 'В071 Горное дело и добыча полезных ископаемых'
	},
	{ value: 'В073 Архитектура', label: 'В073 Архитектура' },
	{
		value:
			'В074 Градостроительство, строительные работы и гражданское строительство',
		label:
			'В074 Градостроительство, строительные работы и гражданское строительство'
	},
	{
		value: 'В075 Кадастр и землеустройство',
		label: 'В075 Кадастр и землеустройство'
	},
	{
		value: 'В076 Стандартизация, сертификация и метрология (по отраслям)',
		label: 'В076 Стандартизация, сертификация и метрология (по отраслям)'
	},
	{
		value: 'В094 Санитарно-профилактические мероприятия',
		label: 'В094 Санитарно-профилактические мероприятия'
	},
	{ value: 'В095 Транспортные услуги', label: 'В095 Транспортные услуги' }
]

const achievements = [
	{
		value: 'претендент на знак «Алтын белгі» ',
		label: 'претендент на знак «Алтын белгі» '
	},
	{
		value:
			'победитель олимпиад и спортивных соревнований (международных, республиканских, областных)» ',
		label:
			'победитель олимпиад и спортивных соревнований (международных, республиканских, областных)» '
	},
	{
		value: 'победитель Республиканской Интернет-олимпиады, проводимой КарТУ»',
		label: 'победитель Республиканской Интернет-олимпиады, проводимой КарТУ'
	}
]

const formPayment = [
	{
		value: 'за счет Республиканского выделенного гранта',
		label: 'за счет Республиканского выделенного гранта'
	},
	{
		value: 'за счет собственных средств',
		label: 'за счет собственных средств'
	},
	{ value: 'за счет работодателя', label: 'за счет работодателя' }
]

const languages = [
	{ value: 'қазақ', label: 'қазақ' },
	{ value: 'русский', label: 'русский' }
]

const consultantDepartment = [
	{ value: 'АиД', label: 'АиД' },
	{ value: 'АНК-СГД', label: 'АНК-СГД' },
	{ value: 'АПП', label: 'АПП' },
	{ value: 'ВК', label: 'ВК' },
	{ value: 'Высшая математика', label: 'Высшая математика' },
	{ value: 'ГРМПИ', label: 'ГРМПИ' },
	{ value: 'Другой источник информации', label: 'Другой источник информации' },
	{ value: 'ИВС', label: 'ИВС' },
	{ value: 'ИК', label: 'ИК' },
	{ value: 'ИТБ', label: 'ИТБ' },
	{ value: 'ИЯ', label: 'ИЯ' },
	{
		value: 'КИТ (Колледж инновационных технологий)',
		label: 'КИТ (Колледж инновационных технологий)'
	},
	{ value: 'КЯиК', label: 'КЯиК' },
	{ value: 'МДиГ', label: 'МДиГ' },
	{ value: 'Механика', label: 'Механика' },
	{ value: 'НТМ', label: 'НТМ' },
	{ value: 'ПТ', label: 'ПТ' },
	{ value: 'РАиОТ', label: 'РАиОТ' },
	{ value: 'РМПИ', label: 'РМПИ' },
	{ value: 'РЯИК', label: 'РЯИК' },
	{ value: 'Смит', label: 'Смит' },
	{ value: 'ТОМиС', label: 'ТОМиС' },
	{ value: 'ТСС', label: 'ТСС' },
	{ value: 'ТТиЛС', label: 'ТТиЛС' },
	{ value: 'ФВ', label: 'ФВ' },
	{ value: 'Физика', label: 'Физика' },
	{ value: 'ХиХТ', label: 'ХиХТ' },
	{ value: 'ЭМП', label: 'ЭМП' },
	{ value: 'ЭС', label: 'ЭС' }
]

const akmolinskayaOblast = [
	{
		value: 'Акмолинская область (все районы и города)',
		label: 'Акмолинская область (все районы и города)'
	}
]

const aktyubinskayaOblast = [
	{
		value: 'Акюбинская область (все районы и города)',
		label: 'Акюбинская область (все районы и города)'
	}
]

const almatinskayaOblast = [
	{
		value: 'Алматинская область (все районы и города)',
		label: 'Алматинская область (все районы и города)'
	}
]

const almaty = [
	{
		value: 'Алматы',
		label: 'Алматы'
	}
]

const astana = [
	{
		value: 'Астана',
		label: 'Астана'
	}
]

const atyrauskaya = [
	{
		value: 'Атырауская (все районы и города)',
		label: 'Атырауская (все районы и города)'
	}
]

const vostochnoKazakhstanskayaOblast = [
	{
		value: 'Восточно-Казахстанская область (все районы и города)',
		label: 'Восточно-Казахстанская область (все районы и города)'
	}
]

const zhambylskaya = [
	{
		value: 'Жамбылская область (все районы и города)',
		label: 'Жамбылская область (все районы и города)'
	}
]

const zko = [
	{
		value: 'Западно-Казахстанская область (все районы и города)',
		label: 'Западно-Казахстанская область (все районы и города)'
	}
]

const karagandinskaya = [
	{ value: 'Абай', label: 'Абай' },
	{ value: 'Караганда', label: 'Караганда' },
	{ value: 'Шахтинск', label: 'Шахтинск' },
	{ value: 'Сарань', label: 'Сарань' },
	{ value: 'Темиртау', label: 'Темиртау' },
	{ value: 'Приозерск', label: 'Приозерск' },
	{ value: 'Балхаш', label: 'Балхаш' },
	{ value: 'Жезказган', label: 'Жезказган' },
	{ value: 'Сатпаев', label: 'Сатпаев' },
	{ value: 'Улытауский', label: 'Улытауский' },
	{ value: 'Актогайский', label: 'Актогайский' },
	{ value: 'Абайский', label: 'Абайский' },
	{ value: 'Бухар-Жырауский', label: 'Бухар-Жырауский' },
	{ value: 'Жанааркинский', label: 'Жанааркинский' },
	{ value: 'Каражал', label: 'Каражал' },
	{ value: 'Нуринский', label: 'Нуринский' },
	{ value: 'Каркаралинский', label: 'Каркаралинский' },
	{ value: 'Осакаровский', label: 'Осакаровский' },
	{ value: 'Шетский', label: 'Шетский' },
]

const kostanajskaya = [
	{ value: 'Костанайская область (все районы и города)', label: 'Костанайская область (все районы и города)' },
]

const kyzylordinskaya = [
	{ value: 'Кызылординская область (все районы и города)', label: 'Кызылординская область (все районы и города)' },
]

const mangystauskaya = [
	{ value: 'Мангыстауская область (все районы и города)', label: 'Мангыстауская область (все районы и города)' },
]

const pavlodarskaya = [
	{ value: 'Павлодарская область (все районы и города)', label: 'Павлодарская область (все районы и города)' },
]

const severoKazakhstanskayaOblast = [
	{ value: 'Северо-Казахстанская область (все районы и города)', label: 'Северо-Казахстанская область (все районы и города)' },
]

const turkestanskaya = [
	{ value: 'Туркестанская область (все районы и города)', label: 'Туркестанская область (все районы и города)' },
]

const shymkent = [
	{ value: 'Шымкент', label: 'Шымкент' },
]

const yuko = [
	{ value: 'Южно-Казахстанская область (все районы и города)', label: 'Южно-Казахстанская область (все районы и города)' },
]


export {
	socialStatus,
	regions,
	cities,
	institutionType,
	institutions,
	formStudy,
	educationProgram,
	achievements,
	formPayment,
	languages,
	consultantDepartment,
	akmolinskayaOblast,
	aktyubinskayaOblast,
	almatinskayaOblast,
	almaty,
	astana,
	atyrauskaya,
	vostochnoKazakhstanskayaOblast,
	zhambylskaya,
	zko,
	karagandinskaya,
	kostanajskaya,
	kyzylordinskaya,
	mangystauskaya,
	pavlodarskaya,
	severoKazakhstanskayaOblast,
	turkestanskaya,
	shymkent,
	yuko
}
